---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructConnectionBeamStart
source: html/827e2907-ab66-57d3-2576-098e2a23c4e9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructConnectionBeamStart Property

"Start Connection"

## Syntax (C#)
```csharp
public static ForgeTypeId StructConnectionBeamStart { get; }
```